src/Catalogs/СК_Ячейки/СК_Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_Ячейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СК_Ячейки/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НовыйШтрихКод(Команда)
	Объект.ШтрихКод = СформироватьШтрихкодEAN13();

КонецПроцедуры


Функция СформироватьШтрихкодEAN13() Экспорт

	ПрефиксУзлаШтрихкода = ПрефиксУзлаШтрихкода();
	
	Возврат ПолучитьШтрихкодПоКоду(Объект.Код, Объект.Код, ПрефиксУзлаШтрихкода);

КонецФункции


Функция ПолучитьШтрихкодПоКоду(Код, Диапазон, ПрефиксУзлаШтрихкода) Экспорт

	Штрихкод = Строка(Диапазон) + ПрефиксУзлаШтрихкода + Формат(Код, "ЧЦ=9; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;

КонецФункции   

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции  

Функция ПрефиксУзлаШтрихкода() Экспорт
	
	Возврат Формат(Константы.ПрефиксШтрихкодовУзлаРИБ.Получить(),"ЧЦ=1; ЧН=; ЧВН=");
	
КонецФункции


&НаСервере
Процедура СоздатьШК()
	Если СтрДлина(Объект.ШтрихКод)<5 Тогда
		Объект.ШтрихКод = СформироватьШтрихкодEAN13();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СоздатьНаименование();
	СоздатьШК();
КонецПроцедуры  

&НаСервере
Процедура СоздатьНаименование()
	Если СтрДлина(Объект.Наименование) <= 5 Тогда
		Если СтрДлина(Объект.Секция)>=1 И
			СтрДлина(Объект.Ряд)>=1 И
			СтрДлина(Объект.Ячейка)>=1 Тогда
			Объект.Наименование = "Секция " + Строка(Объект.Секция) + " / Ряд " + Строка(Объект.Ряд) + " / Ячейка " + Строка(Объект.Ячейка) ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
